%%%-----------------------------------
%%% @Module  : data_scene_text
%%% @Author  : zhenghehe
%%% @Created : 2011.06.14
%%% @Description: 中文文本
%%%-----------------------------------
-module(data_scene_text).
-compile(export_all).

get_check_practice() ->
    <<"要离开场景请停止或者暂停离线挂机！">>.

get_sys_msg(Type) ->
    case Type of
        1 ->
           <<"场景不存在!">>;
        2 ->
           "等级不够";
        3 ->
            "级，无法进入该场景！";
        4 ->
           <<"你必需有【">>;
        5 ->
           <<"】才能进入该场景">>;
        6 ->
           <<"进入副本前请先创建队伍!">>;
        7 ->
           <<"进入该场景前，请先切换全体模式!">>;
        8 ->
           <<"进入该场景前，请先切换阵营模式!">>;
        9 ->
           <<"进入该场景前，请先切换帮派模式!">>;
        10 ->
           <<"进入该场景前，请先切换队伍模式!">>;
        11 ->
           <<"进入该场景前，请先切换善恶模式!">>;		
        12 ->
           "队友等级不够";
        13 ->
           "等级已超过";
        14 ->
           "副本未到开放时间&#13;（开放时间：11:30--13:30,19:00--22:00）";
        15 ->
           "队伍人数不足";
        16 ->
           "人，无法进入该场景！";
        17 ->
           "队伍人数不能大于";
        18 ->
           "人！";
        19 ->
           <<"场景出错!">>;		
        20 ->
           <<"副本不存在!">>;
        21 ->
           <<"当天副本次数已满，无法进入该副本!">>;
        22 ->
           <<"还有其他队员在副本(或其他副本)中">>;
        23 ->
           <<"你所在队伍不在此副本">>;
        24 ->
           <<"你不是队长不能创建副本!">>;
        25 ->
           <<"距离太远，不能创建副本！">>;
        26 ->
           <<"体力不足，不能创建副本！">>;
        27 ->
           <<"队友体力不足，不能创建副本！">>;
        28 ->
           <<"你所在的场景不能创建副本！">>;
        29 -> 
           <<"你正在排队进入场景中，请稍候......">>;    
		    30 ->
		        <<"进入BOSS地图需要阵营模式">>;
        31 ->
           <<"该场景不允许组队进入!">>;
        32 ->
           <<"你在监狱中不能切换场景!">>;
	      33 ->
           <<"当前场景不能进入!">>;
        34 ->
           <<"请在传送口附近切换场景">>;
        35 ->
           <<"巡游中不允许传送">>;
        36 ->
           <<"您在跨服火眼金睛匹配中，无法传送">>;
    		37 ->
               <<"约会中无法传送">>;
    		38 ->
    			 <<"需要通关前一副本关卡">>;
    		39 ->
    			 <<"需要前一章节副本关卡全部二星以上通关">>;
    		40 ->
    			 <<"你的体力值不足，无法进入该副本">>;
    		41 -> 
    			 <<"在队伍中，不能进入单人副本">>;
        42 ->
            <<"无法从当前场景进入副本">>;
        43 ->
           <<"你的精力值不足，无法进入该副本">>;
        44 ->
           <<"你的精力副本收益次数不足，无法进入该副本">>
    end.

get_sys_msg(Type, Args) -> 
    case Type of
        1 -> io_lib:format(<<"你正在排队进入~s中，请稍候">>, Args)
    end.
