%%%-------------------------------------------------------------------
%%% @author JoyHuang
%%% @copyright (C) 2014, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 19. 八月 2014 16:14
%%%-------------------------------------------------------------------
-module(data_scene).

%% API
-export([get/1]).
-include("scene.hrl").

get(100) ->
    #ets_scene{
        id = 100,            %% 场景ID包括资源id
        name = <<"测试地图">>,         %% 场景名称
        type = 0,            %% 场景类型(0:安全场景, 1:野外场景, 2:副本场景)
        x = 10,               %% 默认开始点
        y = 10,               %% 默认开始点
        elem=[],             %% 场景元素
        requirement = [],    %% 进入需求
        npc = [],
        mon = []
    };

get(_) ->
    [].